/*  $Id$
 * ===========================================================================
 *
 *                            PUBLIC DOMAIN NOTICE
 *               National Center for Biotechnology Information
 *
 *  This software/database is a "United States Government Work" under the
 *  terms of the United States Copyright Act.  It was written as part of
 *  the author's official duties as a United States Government employee and
 *  thus cannot be copyrighted.  This software/database is freely available
 *  to the public for use. The National Library of Medicine and the U.S.
 *  Government have not placed any restriction on its use or reproduction.
 *
 *  Although all reasonable efforts have been taken to ensure the accuracy
 *  and reliability of the software and data, the NLM and the U.S.
 *  Government do not and cannot warrant the performance or results that
 *  may be obtained by using this software or data. The NLM and the U.S.
 *  Government disclaim all warranties, express or implied, including
 *  warranties of performance, merchantability or fitness for any particular
 *  purpose.
 *
 *  Please cite the author in any work or product based on this material.
 *
 * ===========================================================================
 *
 * Authors:  Vladimir Ivanov
 *           Anton Lavrentiev
 *
 * File Description:
 *   Tar archive API.
 *
 *   Supports subset of POSIX.1-1988 (ustar) format.

                   (value & TUWRITE ? S_IWRITE : 0) |
#endif
#if   defined(S_IWUSR)
                   (value & TUEXEC  ? S_IXUSR  : 0) |
#elif defined(S_IEXEC)
                   (value & TUEXEC  ? S_IEXEC  : 0) |
#endif
#ifdef S_IRGRP
                   (value & TGREAD  ? S_IRGRP  : 0) |
#endif
#ifdef S_IWGRP
                   (value & TGWRITE ? S_IWGRP  : 0) |
#endif
#ifdef S_IXGRP
                   (value & TGEXEC  ? S_IXGRP  : 0) |
#endif
#ifdef S_IROTH
                   (value & TOREAD  ? S_IROTH  : 0) |
#endif
#ifdef S_IWOTH
                   (value & TOWRITE ? S_IWOTH  : 0) |
#endif
#ifdef S_IXOTH
                   (value & TOEXEC  ? S_IXOTH  : 0) |
#endif
                   0);
    return mode;
}


static unsigned int s_ModeToTar(mode_t mode)
{
    /* Foresee that the mode can be extracted on a different platform */
    unsigned int value = (
#ifdef S_ISUID
                           (mode & S_ISUID  ? TSUID   : 0) |
#endif
#ifdef S_ISGID
                           (mode & S_ISGID  ? TSGID   : 0) |
#endif
#ifdef S_ISVTX
                           (mode & S_ISVTX  ? TSVTX   : 0) |
#endif
#if   defined(S_IRUSR)
                           (mode & S_IRUSR  ? TUREAD  : 0) |
#elif defined(S_IREAD)
                           (mode & S_IREAD  ? TUREAD  : 0) |
#endif
#if   defined(S_IWUSR)
                           (mode & S_IWUSR  ? TUWRITE : 0) |
#elif defined(S_IWRITE)
                           (mode & S_IWRITE ? TUWRITE : 0) |
#endif
#if   defined(S_IXUSR)
                           (mode & S_IXUSR  ? TUEXEC  : 0) |
#elif defined(S_IEXEC)
                           (mode & S_IEXEC  ? TUEXEC  : 0) |
#endif
#if   defined(S_IRGRP)
                           (mode & S_IRGRP  ? TGREAD  : 0) |
#elif defined(S_IREAD)
                           /* emulate read permission when file is readable */
                           (mode & S_IREAD  ? TGREAD  : 0) |
#endif
#ifdef S_IWGRP
                           (mode & S_IWGRP  ? TGWRITE : 0) |
#endif
#ifdef S_IXGRP
                           (mode & S_IXGRP  ? TGEXEC  : 0) |
#endif
#if   defined(S_IROTH)
                           (mode & S_IROTH  ? TOREAD  : 0) |
#elif defined(S_IREAD)
                           /* emulate read permission when file is readable */
                           (mode & S_IREAD  ? TOREAD  : 0) |
#endif
#ifdef S_IWOTH
                           (mode & S_IWOTH  ? TOWRITE : 0) |
#endif
#ifdef S_IXOTH
                           (mode & S_IXOTH  ? TOEXEC  : 0) |
#endif
                           0);
    return value;
}


static size_t s_Length(const char* ptr, size_t size)
{
    const char* null = (const char*) memchr(ptr, '\0', size);
    return null ? (size_t)(null - ptr) : size;
}


//////////////////////////////////////////////////////////////////////////////
//
// Constants / macros / typedefs
//

/// Tar block size
static const size_t kBlockSize = 512;

/// Round up to the nearest multiple of kBlockSize
#define ALIGN_SIZE(size) ((((size) + kBlockSize-1) / kBlockSize) * kBlockSize)


/// POSIX tar file header
struct SHeader {        // byte offset
    char name[100];     //   0
    char mode[8];       // 100
    char uid[8];        // 108
    char gid[8];        // 116
    char size[12];      // 124
    char mtime[12];     // 136
    char checksum[8];   // 148
    char typeflag;      // 156
    char linkname[100]; // 157
    char magic[6];      // 257
    char version[2];    // 263
    char uname[32];     // 265
    char gname[32];     // 297
    char devmajor[8];   // 329
    char devminor[8];   // 337
    char prefix[155];   // 345 (not valid with old GNU format)
};                      // 500


/// Block as a header.
union TBlock {
    char    buffer[kBlockSize];
    SHeader header;
};


static void s_TarChecksum(TBlock* block)
{
    SHeader* h = &block->header;

    // Compute the checksum
    memset(h->checksum, ' ', sizeof(h->checksum));
    unsigned long checksum = 0;
    unsigned char* p = (unsigned char*) block->buffer;
    for (size_t i = 0; i < sizeof(block->buffer); i++) {
        checksum += *p++;
    }
    // Checksum (Special: 6 digits, then '\0', then a space [already in place])
    if (!s_NumToOctal((unsigned short) checksum/*cut it!*/,
                      h->checksum, sizeof(h->checksum) - 2)) {
        NCBI_THROW(CTarException, eMemory, "Cannot store checksum");
    }
    h->checksum[6] = '\0';
}


/// Structure with additional info about entries being processed.
