/*  $Id$
 * ===========================================================================
 *
 *                            PUBLIC DOMAIN NOTICE
 *               National Center for Biotechnology Information
 *
 *  This software/database is a "United States Government Work" under the
 *  terms of the United States Copyright Act.  It was written as part of
 *  the author's official duties as a United States Government employee and
 *  thus cannot be copyrighted.  This software/database is freely available
 *  to the public for use. The National Library of Medicine and the U.S.
 *  Government have not placed any restriction on its use or reproduction.
 *
 *  Although all reasonable efforts have been taken to ensure the accuracy
 *  and reliability of the software and data, the NLM and the U.S.
 *  Government do not and cannot warrant the performance or results that
 *  may be obtained by using this software or data. The NLM and the U.S.
 *  Government disclaim all warranties, express or implied, including
 *  warranties of performance, merchantability or fitness for any particular
 *  purpose.
 *
 *  Please cite the author in any work or product based on this material.
 *
 * ===========================================================================
 *
 * Authors:  Vladimir Ivanov
 *
 * File Description:  TAR archive API
 *
 */

#include <ncbi_pch.hpp>
#include <util/compress/tar.hpp>
#include <memory>

#if !defined(NCBI_OS_MSWIN)  &&  !defined(NCBI_OS_UNIX)
#  error "Class CTar defined only for MS Windows and UNIX platforms"
#endif

#include <ncbi_pch.hpp>
#include <corelib/ncbifile.hpp>
#include <corelib/ncbi_limits.h>
#include <corelib/ncbi_system.hpp>

#if defined(NCBI_OS_MSWIN)
#  include <io.h>
#elif defined(NCBI_OS_UNIX)
#  endif


BEGIN_NCBI_SCOPE


// Convert number to octal string
void s_NumToOctal(unsigned long value, char* ptr, size_t size)
{
    memset(ptr, ' ', size);
    do {
        ptr[--size] = '0' + char(value & 7);
        value >>= 3;
    } while (size);
}

// Macro for s_NumToOctal() calls simplification 
#define NUM_TO_OCTAL(value, field) \
    s_NumToOctal((unsigned long)value, field, sizeof(field)-1);



//////////////////////////////////////////////////////////////////////////////
//
// Constants / macro / typedefs
//

/// TAR block size
static const streamsize kBlockSize = 512;

/// Default buffer size (must be multiple kBlockSize)
static const streamsize kDefaultBufferSize = 16*1024;

// Special chars
static const char kNull  = '\0';
static const char kSlash = '/';

/// Macro to compute size that is multiple to kBlockSize
#define ALIGN_BLOCK_SIZE(size) \
    if ( size % kBlockSize != 0 ) { \
        size = (size / kBlockSize + 1) * kBlockSize; \
    }

/// Macro to check that all mask bits are set in flags
#define F_ISSET(mask) ((GetFlags() & (mask)) == (mask))

/// Macro to check that at least one of mask bits is set in flags
#define F_ISSET_ONEOF(mask) ((GetFlags() & (mask)) > 0)


/// TAR POSIX file header
struct SHeader {          // byte offset
    char name[100];       //   0
    char mode[8];         // 100
    char uid[8];          // 108
    char gid[8];          // 116
    char size[12];        // 124
    char mtime[12];       // 136
    char checksum[8];     // 148
    char typeflag;        // 156
    char linkname[100];   // 157
    char magic[6];        // 257
    char version[2];      // 263
    char uname[32];       // 265
    char gname[32];       // 297
    char devmajor[8];     // 329
    char devminor[8];     // 337
    char prefix[155];     // 345
};                        // 500

/// Block to read
union TBlock {
  char     buffer[kBlockSize];
  SHeader  header;
};

/// Name field size
static const size_t kNameFieldSize   = 100;
/// Name prefix field size
static const size_t kPrefixFieldSize = 155;
/// User/group name field size
static const size_t kAccountFieldSize = 32;


//////////////////////////////////////////////////////////////////////////////
//
// CTarEntryInfo
//

void CTarEntryInfo::GetMode(CDirEntry::TMode* user_mode,
                            CDirEntry::TMode* group_mode,
                            CDirEntry::TMode* other_mode) const
{
    unsigned int mode = (unsigned int)m_Stat.st_mode;
    // Other
    if (other_mode) {
        *other_mode = mode & 0007;
    }
    mode >>= 3;
    // Group
    if (group_mode) {
        *group_mode = mode & 0007;
    }
    mode >>= 3;
    // User
    if (user_mode) {
        *user_mode = mode & 0007;
    }
    return;
}


